app/controllers/user_controller.rb

	def battery
		secret = params[:secret]
		user = User.where(:secret => secret).first
		if user
			battery = user.locations.last.battery
---
SELECT  "users".* FROM "users" WHERE "users"."secret" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["secret", "f24d098dc75074a08a0ac2bc55d7ed76"]]
SELECT  "locations".* FROM "locations" WHERE "locations"."user_id" = ?  ORDER BY "locations"."id" DESC LIMIT 1  [["user_id", 30]]

	def music
		secret = params[:secret]
		user = User.where(:secret => secret).first
		if user
			if user.music == "false"
				user.music = "true"
			else
				user.music = "false"
			end
			user.save!
---
SELECT  "users".* FROM "users" WHERE "users"."secret" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["secret", "23a0a35df84bc3a8ad745bdb73f98fae"]]
UPDATE "users" SET "music" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["music", "true"], ["updated_at", "2017-04-15 22:43:56.420689"], ["id", 27]]

	def update
		secret = params[:secret]
		latitude = params[:latitude]
		longitude = params[:longitude]
		battery = params[:battery]
		user = User.where(:secret => secret).first
		if user
			user.locations.create(:latitude => latitude,
				:longitude => longitude ,:battery => battery)
---
SELECT  "users".* FROM "users" WHERE "users"."secret" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["secret", "kush"]]
INSERT INTO "locations" ("latitude", "longitude", "battery", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["latitude", "11"], ["longitude", "8698"], ["battery", "23"], ["user_id", 1], ["created_at", "2017-04-15 15:41:02.070373"], ["updated_at", "2017-04-15 15:41:02.070373"]]

	def getlocation
		secret = params[:secret]
		user = User.where(:secret => secret).first
		if user
			locs = user.locations.order('created_at DESC').limit(100)
			data = Hash.new
			if locs.first
---
SELECT  "users".* FROM "users" WHERE "users"."secret" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["secret", "203842ce945857e74e4596d17d7085d4"]]
SELECT  "locations".* FROM "locations" WHERE "locations"."user_id" = ?  ORDER BY "locations"."id" ASC LIMIT 1  [["user_id", 26]]

	def getsecret
		name = params[:name]
		password = params[:password]
		user = User.where(:name => name , :password => password).first
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["name", "cheekko"], ["password", "misra"]]