app/controllers/user_login_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."secret" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["secret", "1"]]
---
	def check
		secret = params[:secret]
		user = User.where(:secret => secret).first

SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["name", "kush"], ["password", "cheekoo"]]
---
	def checklogin

		name = params[:name]
		password = params[:password]

		user = User.where(:name => name , :password => password).first

SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."password" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["name", "kush"], ["password", "cheekoo2609"]]
INSERT INTO "users" ("name", "password", "secret", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "kush"], ["password", "cheekoo2609"], ["secret", "6d5ff9cd802f6e03d48395db0aa02cca"], ["created_at", "2017-04-15 11:58:53.872012"], ["updated_at", "2017-04-15 11:58:53.872012"]]
---
	def create
		name = params[:name]
		password = params[:password]
		email = params[:email]
		mob = params[:mob]

		user = User.where(:name => name, :password=> password).first
		if user
			return response_data({},"user already there","403")
		else
			user = User.new
			user.name = name
			user.password = password
			user.secret = SecureRandom.hex

			user.mob = mob
			user.email = email

			user.save